virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/sfr.h
/* -------- SFR_AICREDIR : (SFR Offset: 0x54) (R/W 32) AIC Interrupt Redirection Register -------- */
#define SFR_AICREDIR_NSAIC_Pos                _U_(0)                                               /**< (SFR_AICREDIR) Interrupt Redirection to Non-Secure AIC Position */
#define SFR_AICREDIR_NSAIC_Msk                (_U_(0x1) << SFR_AICREDIR_NSAIC_Pos)                 /**< (SFR_AICREDIR) Interrupt Redirection to Non-Secure AIC Mask */
#define SFR_AICREDIR_NSAIC(value)             (SFR_AICREDIR_NSAIC_Msk & ((value) << SFR_AICREDIR_NSAIC_Pos))
#define SFR_AICREDIR_AICREDIRKEY_Pos          _U_(1)                                               /**< (SFR_AICREDIR) Unlock Key Position */
#define SFR_AICREDIR_AICREDIRKEY_Msk          (_U_(0x7FFFFFFF) << SFR_AICREDIR_AICREDIRKEY_Pos)    /**< (SFR_AICREDIR) Unlock Key Mask */
#define SFR_AICREDIR_AICREDIRKEY(value)       (SFR_AICREDIR_AICREDIRKEY_Msk & ((value) << SFR_AICREDIR_AICREDIRKEY_Pos))
#define SFR_AICREDIR_Msk                      _U_(0xFFFFFFFF)                                      /**< (SFR_AICREDIR) Register Mask  */


/* -------- SFR_L2CC_HRAMC : (SFR Offset: 0x58) (R/W 32) L2CC_HRAMC1 -------- */
#define SFR_L2CC_HRAMC_SRAM_SEL_Pos           _U_(0)                                               /**< (SFR_L2CC_HRAMC) SRAM Selector Position */
#define SFR_L2CC_HRAMC_SRAM_SEL_Msk           (_U_(0x1) << SFR_L2CC_HRAMC_SRAM_SEL_Pos)            /**< (SFR_L2CC_HRAMC) SRAM Selector Mask */
#define SFR_L2CC_HRAMC_SRAM_SEL(value)        (SFR_L2CC_HRAMC_SRAM_SEL_Msk & ((value) << SFR_L2CC_HRAMC_SRAM_SEL_Pos))
#define SFR_L2CC_HRAMC_Msk                    _U_(0x00000001)                                      /**< (SFR_L2CC_HRAMC) Register Mask  */


/* -------- SFR_I2SCLKSEL : (SFR Offset: 0x90) (R/W 32) I2SC Register -------- */
#define SFR_I2SCLKSEL_CLKSEL0_Pos             _U_(0)                                               /**< (SFR_I2SCLKSEL) Clock Selection 0 Position */
#define SFR_I2SCLKSEL_CLKSEL0_Msk             (_U_(0x1) << SFR_I2SCLKSEL_CLKSEL0_Pos)              /**< (SFR_I2SCLKSEL) Clock Selection 0 Mask */
#define SFR_I2SCLKSEL_CLKSEL0(value)          (SFR_I2SCLKSEL_CLKSEL0_Msk & ((value) << SFR_I2SCLKSEL_CLKSEL0_Pos))
#define SFR_I2SCLKSEL_CLKSEL1_Pos             _U_(1)                                               /**< (SFR_I2SCLKSEL) Clock Selection 1 Position */
#define SFR_I2SCLKSEL_CLKSEL1_Msk             (_U_(0x1) << SFR_I2SCLKSEL_CLKSEL1_Pos)              /**< (SFR_I2SCLKSEL) Clock Selection 1 Mask */
#define SFR_I2SCLKSEL_CLKSEL1(value)          (SFR_I2SCLKSEL_CLKSEL1_Msk & ((value) << SFR_I2SCLKSEL_CLKSEL1_Pos))
#define SFR_I2SCLKSEL_Msk                     _U_(0x00000003)                                      /**< (SFR_I2SCLKSEL) Register Mask  */

#define SFR_I2SCLKSEL_CLKSEL_Pos              _U_(0)                                               /**< (SFR_I2SCLKSEL Position) Clock Selection x */
#define SFR_I2SCLKSEL_CLKSEL_Msk              (_U_(0x3) << SFR_I2SCLKSEL_CLKSEL_Pos)               /**< (SFR_I2SCLKSEL Mask) CLKSEL */
#define SFR_I2SCLKSEL_CLKSEL(value)           (SFR_I2SCLKSEL_CLKSEL_Msk & ((value) << SFR_I2SCLKSEL_CLKSEL_Pos)) 

/* -------- SFR_QSPICLK_REG : (SFR Offset: 0x94) (R/W 32) QSPI Clock Pad Supply Select Register -------- */
#define SFR_QSPICLK_REG_SUP_SEL_Pos           _U_(0)                                               /**< (SFR_QSPICLK_REG) Supply Selection Position */
#define SFR_QSPICLK_REG_SUP_SEL_Msk           (_U_(0x1) << SFR_QSPICLK_REG_SUP_SEL_Pos)            /**< (SFR_QSPICLK_REG) Supply Selection Mask */
#define SFR_QSPICLK_REG_SUP_SEL(value)        (SFR_QSPICLK_REG_SUP_SEL_Msk & ((value) << SFR_QSPICLK_REG_SUP_SEL_Pos))
#define SFR_QSPICLK_REG_Msk                   _U_(0x00000001)                                      /**< (SFR_QSPICLK_REG) Register Mask  */


/** \brief SFR register offsets definitions */
#define SFR_DDRCFG_REG_OFST            (0x04)              /**< (SFR_DDRCFG) DDR Configuration Register Offset */
#define SFR_OHCIICR_REG_OFST           (0x10)              /**< (SFR_OHCIICR) OHCI Interrupt Configuration Register Offset */
#define SFR_OHCIISR_REG_OFST           (0x14)              /**< (SFR_OHCIISR) OHCI Interrupt Status Register Offset */
#define SFR_SECURE_REG_OFST            (0x28)              /**< (SFR_SECURE) Security Configuration Register Offset */
#define SFR_UTMICKTRIM_REG_OFST        (0x30)              /**< (SFR_UTMICKTRIM) UTMI Clock Trimming Register Offset */
#define SFR_UTMIHSTRIM_REG_OFST        (0x34)              /**< (SFR_UTMIHSTRIM) UTMI High-Speed Trimming Register Offset */
#define SFR_UTMIFSTRIM_REG_OFST        (0x38)              /**< (SFR_UTMIFSTRIM) UTMI Full-Speed Trimming Register Offset */
#define SFR_UTMISWAP_REG_OFST          (0x3C)              /**< (SFR_UTMISWAP) UTMI DP/DM Pin Swapping Register Offset */
#define SFR_CAN_REG_OFST               (0x48)              /**< (SFR_CAN) CAN Memories Address-based Register Offset */
#define SFR_SN0_REG_OFST               (0x4C)              /**< (SFR_SN0) Serial Number 0 Register Offset */
#define SFR_SN1_REG_OFST               (0x50)              /**< (SFR_SN1) Serial Number 1 Register Offset */
#define SFR_AICREDIR_REG_OFST          (0x54)              /**< (SFR_AICREDIR) AIC Interrupt Redirection Register Offset */
#define SFR_L2CC_HRAMC_REG_OFST        (0x58)              /**< (SFR_L2CC_HRAMC) L2CC_HRAMC1 Offset */
#define SFR_I2SCLKSEL_REG_OFST         (0x90)              /**< (SFR_I2SCLKSEL) I2SC Register Offset */
#define SFR_QSPICLK_REG_REG_OFST       (0x94)              /**< (SFR_QSPICLK_REG) QSPI Clock Pad Supply Select Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SFR register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SFR_DDRCFG;         /**< Offset: 0x04 (R/W  32) DDR Configuration Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  uint32_t                       SFR_OHCIICR;        /**< Offset: 0x10 (R/W  32) OHCI Interrupt Configuration Register */
  __I   uint32_t                       SFR_OHCIISR;        /**< Offset: 0x14 (R/   32) OHCI Interrupt Status Register */
  __I   uint8_t                        Reserved3[0x10];
  __IO  uint32_t                       SFR_SECURE;         /**< Offset: 0x28 (R/W  32) Security Configuration Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       SFR_UTMICKTRIM;     /**< Offset: 0x30 (R/W  32) UTMI Clock Trimming Register */
  __IO  uint32_t                       SFR_UTMIHSTRIM;     /**< Offset: 0x34 (R/W  32) UTMI High-Speed Trimming Register */
  __IO  uint32_t                       SFR_UTMIFSTRIM;     /**< Offset: 0x38 (R/W  32) UTMI Full-Speed Trimming Register */
  __IO  uint32_t                       SFR_UTMISWAP;       /**< Offset: 0x3C (R/W  32) UTMI DP/DM Pin Swapping Register */
  __I   uint8_t                        Reserved5[0x08];
  __IO  uint32_t                       SFR_CAN;            /**< Offset: 0x48 (R/W  32) CAN Memories Address-based Register */
  __I   uint32_t                       SFR_SN0;            /**< Offset: 0x4C (R/   32) Serial Number 0 Register */
  __I   uint32_t                       SFR_SN1;            /**< Offset: 0x50 (R/   32) Serial Number 1 Register */
  __IO  uint32_t                       SFR_AICREDIR;       /**< Offset: 0x54 (R/W  32) AIC Interrupt Redirection Register */
  __IO  uint32_t                       SFR_L2CC_HRAMC;     /**< Offset: 0x58 (R/W  32) L2CC_HRAMC1 */
  __I   uint8_t                        Reserved6[0x34];
  __IO  uint32_t                       SFR_I2SCLKSEL;      /**< Offset: 0x90 (R/W  32) I2SC Register */
  __IO  uint32_t                       SFR_QSPICLK_REG;    /**< Offset: 0x94 (R/W  32) QSPI Clock Pad Supply Select Register */
} sfr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_SFR_COMPONENT_H_ */
